Revit 2024 API
BuildingPad Class
 Represents a BuildingPad element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class BuildingPad : CeilingAndFloor
Visual Basic
Public Class BuildingPad _
	Inherits CeilingAndFloor
Visual C++
public ref class BuildingPad : public CeilingAndFloor
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Architecture.BuildingPad
See Also
BuildingPad Members
Autodesk.Revit.DB.Architecture Namespace